Revit 2027 API
Rebar.GetBarIndexFromReference Method
 Given a reference that represents a part of a bar, this method will return the bar index.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetBarIndexFromReference(
	Reference barReference
)
Public Function GetBarIndexFromReference (
	barReference As Reference
) As Integer
public:
int GetBarIndexFromReference(
	Reference^ barReference
)
member GetBarIndexFromReference :
        barReference : Reference -> int
Parameters
barReference Reference
 The Reference of the Rebar element.
Return Value
Int32
 The bar index the reference refers to.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The method returns an index between 0 and NumberOfBarPositions - 1 if it the given reference represents a part of a bar. Otherwise will return -1.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace